
//itemid:2430033
//卷轴碎片合成卷轴
/*
头盔敏捷卷轴 2040029 2040031
头盔智力卷轴 2040025 2040026
脸部装饰生命卷轴 2040100
眼部装饰智力卷轴 2040206 2040205
耳环智力卷轴 2040301 2040302
耳环敏捷卷轴 2040317 2040318
耳环装饰运气卷轴 2040321 2040323
上衣运气卷轴 2040413 2040412
上衣力量卷轴 2040418 2040419 
全身铠甲敏捷卷轴 2040501 2040502 2040506
裤裙防御必成卷 2040603
鞋子敏捷度卷轴 2040702 
手套攻击卷轴 2040826
手套敏捷卷轴 2040802
盾牌防御卷轴 2040902
披风魔防卷轴 2041002
戒指智力卷轴 2041104
项链 2041200
腰带力量卷轴 2041300
单手剑攻击卷轴 2043001 2043002 2043003
单手斧攻击卷轴 2043101 2043102 2043103
单手钝器攻击卷轴 2043201 2043202 2043203
短剑攻击卷轴 2043301 2043302 2043303
短杖魔力卷轴 2043701 2043702 2043703
长杖魔力卷轴 2043801 2043802 2043803
双手剑攻击卷轴 2044001 2044002 2044003
双手斧攻击卷轴 2044101 2044102 2044103
双手钝器攻击卷轴 2044201 2044202 2044203
枪攻击卷轴 2044301 2044302 2044303
矛攻击卷轴 2044401 2044402 2044403
弓攻击卷轴 2044501 2044502 2044503
弩攻击卷轴 2044601 2044602 2044603
拳套攻击卷轴 2044701 2044702 2044703
拳甲攻击卷轴 2044801 2044802 2044803
短枪攻击卷轴 2044901 2044902 2044903
宠物速度卷轴 2048001

披风防寒卷轴 2041058
暗黑龙王石 2041200
智慧之石 2041212
鞋子防滑卷轴 2040727
白医卷轴 2049000 2049001 2049002 2049003
混沌卷轴 2049100
骗子树液 2049101
冒险岛糖浆 2049102
工作人员装备专用卷轴 2049104
红鼻子创口贴 2040110 ~ 2040119
海蓝拖鞋专用卷轴 2049103
休彼德蔓的珠子 2041211
蝙蝠怪的鞋子力量卷轴 2040728~2040739
枫叶手套攻击力诅咒卷轴 2049105~2049110
企鹅国王的武器卷轴(2043021 2043116 2043216 2043311 2043711 2043811 2044024 2044116 2044216 2044316 2044416 2044511 2044611 2044711 2044816 2044909)===> 2049112
配饰力量卷轴70 2049200 ~ 2049200

  2043000 单手剑攻击卷轴100%
  2043001 单手剑攻击卷轴60%
  2043002 单手剑攻击卷轴10%
  2043003 单手剑攻击必成卷
  2043008 单手剑魔力卷轴10%
  2043009 单手剑魔力卷轴60%
  2043100 单手斧攻击卷轴100%
  2043101 单手斧攻击卷轴60%
  2043102 单手斧攻击卷轴10%
  2043103 单手斧攻击必成卷
  2043200 单手钝器攻击卷轴100%
  2043201 单手钝器攻击卷轴60%
  2043202 单手钝器攻击卷轴10%
  2043203 单手钝器攻击必成卷
  2043300 短剑攻击卷轴100%
  2043301 短剑攻击卷轴60%
  2043302 短剑攻击卷轴10%
  2043303 短剑攻击必成卷
  2043700 短杖魔力卷轴100%
  2043701 短杖魔力卷轴60%
  2043702 短杖魔力卷轴10%
  2043703 短杖魔力必成卷
  2043800 长杖魔力卷轴100%
  2043801 长杖魔力卷轴60%
  2043802 长杖魔力卷轴10%
  2043803 长杖魔力必成卷
  2044000 双手剑攻击卷轴100%
  2044001 双手剑攻击卷轴60%
  2044002 双手剑攻击卷轴10%
  2044003 双手剑攻击必成卷
  2044100 双手斧攻击卷轴100%
  2044101 双手斧攻击卷轴60%
  2044102 双手斧攻击卷轴10%
  2044103 双手斧攻击必成卷
  2044200 双手钝器攻击卷轴100%
  2044201 双手钝器攻击卷轴60%
  2044202 双手钝器攻击卷轴10%
  2044203 双手钝器攻击必成卷
  2044300 枪攻击卷轴100%
  2044301 枪攻击卷轴60%
  2044302 枪攻击卷轴10%
  2044303 枪攻击必成卷
  2044400 矛攻击卷轴100%
  2044401 矛攻击卷轴60%
  2044402 矛攻击卷轴10%
  2044403 矛攻击必成卷
  2044500 弓攻击卷轴100%
  2044501 弓攻击卷轴60%
  2044502 弓攻击卷轴10%
  2044503 弓攻击必成卷
  2044600 弩攻击卷轴100%
  2044601 弩攻击卷轴60%
  2044602 弩攻击卷轴10%
  2044603 弩攻击必成卷
  2044700 拳套攻击卷轴100%
  2044701 拳套攻击卷轴60%
  2044702 拳套攻击卷轴10%
  2044703 拳套攻击必成卷
  2044800 拳甲攻击卷轴100%
  2044801 拳甲攻击卷轴60%
  2044802 拳甲攻击卷轴10%
  2044900 短枪攻击卷轴100%
  2044900 短枪攻击卷轴60%
  2044900 短枪攻击卷轴10%
  2044900 短枪攻击必成卷
  
  2048000 宠物速度卷轴100%
  2048001 宠物速度卷轴60%
  2048002 宠物速度卷轴10%
  2048003 宠物跳跃力卷轴100%
  2048004 宠物跳跃力卷轴60%
  2048005 宠物跳跃力卷轴10%
  2048010 宠物力量卷轴60%
  2048011 宠物敏捷卷轴60%
  2048012 宠物智力卷轴60%
  2048013 宠物运气卷轴60%
  2049100 混沌卷轴60%
  2041100 戒指力量卷轴100%
  2041101 戒指力量卷轴60%
  2041102 戒指力量卷轴10%
  2041103 戒指敏捷卷轴100%
  2041104 戒指敏捷卷轴60%
  2041105 戒指敏捷卷轴10%
  2041106 戒指智力卷轴100%
  2041107 戒指智力卷轴60%
  2041108 戒指智力卷轴10%
  2041109 戒指运气卷轴100%
  2041110 戒指运气卷轴60%
  2041111 戒指运气卷轴10%

  2041300 腰带力量卷轴100%
  2041301 腰带力量卷轴60%
  2041302 腰带力量卷轴10%
  2041303 腰带敏捷卷轴100%
  2041304 腰带敏捷卷轴60%
  2041305 腰带敏捷卷轴10%
  2041306 腰带智力卷轴100%
  2041307 腰带智力卷轴60%
  2041308 腰带智力卷轴10%
  2041309 腰带运气卷轴100%
  2041310 腰带运气卷轴60%
  2041311 腰带运气卷轴10%

  2040758 鞋子攻击卷轴100%
  2040759 鞋子攻击卷轴60%
  2040760 鞋子攻击卷轴10%
  2040703 鞋子跳跃卷轴100%
  2040704 鞋子跳跃卷轴60%
  2040705 鞋子跳跃卷轴10%
  2040706 鞋子速度卷轴100%
  2040707 鞋子速度卷轴60%
  2040708 鞋子速度卷轴10%

  2040024 头盔智力卷轴100%
  2040025 头盔智力卷轴60%
  2040026 头盔智力卷轴10%
  2040027 头盔敏捷卷轴100%
  2040028 头盔敏捷卷轴60%
  2040029 头盔敏捷卷轴10%

  2040205 眼部装饰智力卷轴10%
  2040206 眼部装饰智力卷轴60%
  2040207 眼部装饰智力卷轴100%

  2040300 耳环智力卷轴100%
  2040301 耳环智力卷轴60%
  2040302 耳环智力卷轴10%
  2040316 耳环敏捷卷轴100%
  2040317 耳环敏捷卷轴60%
  2040318 耳环敏捷卷轴10%
  2040319 耳环装饰运气卷轴100%
  2040321 耳环装饰运气卷轴60%
  2040323 耳环装饰运气卷轴10%

  2040412 上衣运气卷轴10%
  2040413 上衣运气卷轴60%
  2040414 上衣运气卷轴100%
  2040417 上衣力量卷轴100%
  2040418 上衣力量卷轴60%
  2040419 上衣力量卷轴10%

  2040500 全身铠甲敏捷卷轴100%
  2040501 全身铠甲敏捷卷轴60%
  2040502 全身铠甲敏捷卷轴10%
  2040506 全身铠甲敏捷必成卷
  2040512 全身铠甲智力卷轴100%
  2040513 全身铠甲智力卷轴60%
  2040514 全身铠甲智力卷轴10%
  2040515 全身铠甲运气卷轴100%
  2040516 全身铠甲运气卷轴60%
  2040517 全身铠甲运气卷轴10%
  2040530 全身盔甲力量卷轴100%
  2040532 全身盔甲力量卷轴60%
  2040534 全身盔甲力量卷轴10%

  2040612 裤裙敏捷卷轴10%
  2040613 裤裙敏捷卷轴60%
  2040614 裤裙敏捷卷轴100%
  2040617 裤裙跳跃卷轴100%
  2040618 裤裙跳跃卷轴60%
  2040619 裤裙跳跃卷轴10%

  2040803 手套攻击卷轴100%
  2040804 手套攻击卷轴60%
  2040805 手套攻击卷轴10%
  2040807 手套攻击必成卷
  2040816 手套魔力卷轴10%
  2040817 手套魔力卷轴60%
  2040818 手套魔力卷轴100%


  2040914 盾牌攻击卷轴60%
  2040915 盾牌攻击卷轴10%
  2040918 盾牌魔力卷轴100%
  2040919 盾牌魔力卷轴60%
  2040920 盾牌魔力卷轴10%
  2040923 盾牌运气卷轴100%
  2040924 盾牌运气卷轴60%
  2040925 盾牌运气卷轴10%
  2040929 盾牌力量卷轴100%
  2040931 盾牌力量卷轴60%
  2040933 盾牌力量卷轴10%

  2041012 披风力量卷轴100%
  2041013 披风力量卷轴60%
  2041014 披风力量卷轴10%
  2041015 披风敏捷卷轴100%
  2041016 披风敏捷卷轴60%
  2041017 披风敏捷卷轴10%
  2041018 披风智力卷轴100%
  2041019 披风智力卷轴60%
  2041020 披风智力卷轴10%
  2041021 披风运气卷轴100%
  2041022 披风运气卷轴60%
  2041023 披风运气卷轴10%
*/
var 战士 = Array(
    Array(2043001, 40),//单手剑攻击卷轴60%
    Array(2043002, 40),//单手剑攻击卷轴10%
    Array(2043003, 800),//单手剑攻击必成卷
    Array(2043101, 40),//单手斧攻击卷轴60%
    Array(2043102, 40),//单手斧攻击卷轴10%
    Array(2043103, 800),//单手斧攻击必成卷
    Array(2043201, 40),//单手钝器攻击卷轴60%
    Array(2043202, 40),//单手钝器攻击卷轴10%
    Array(2043203, 800),//单手钝器攻击必成卷
    Array(2044001, 40),//双手剑攻击卷轴60%
    Array(2044002, 40),//双手剑攻击卷轴10%
    Array(2044003, 800),//双手剑攻击必成卷
    Array(2044101, 40),//双手斧攻击卷轴60%
    Array(2044102, 40),//双手斧攻击卷轴10%
    Array(2044103, 800),//双手斧攻击必成卷
    Array(2044201, 40),//双手钝器攻击卷轴60%
    Array(2044202, 40),//双手钝器攻击卷轴10%
    Array(2044203, 800),//双手钝器攻击必成卷
    Array(2044301, 40),//枪攻击卷轴60%
    Array(2044302, 40),//枪攻击卷轴10%
    Array(2044303, 800),//枪攻击必成卷
    Array(2044401, 40),//矛攻击卷轴60%
    Array(2044402, 40),//矛攻击卷轴10%
    Array(2044403, 800)//矛攻击必成卷
);
var 法师 = Array(
    Array(2043008, 20),//单手剑魔力卷轴10%
    Array(2043009, 20),//单手剑魔力卷轴60%
    Array(2043701, 40),//短杖魔力卷轴60%
    Array(2043702, 40),//短杖魔力卷轴10%
    Array(2043703, 600),//短杖魔力必成卷
    Array(2043801, 40),//长杖魔力卷轴60%
    Array(2043802, 40),//长杖魔力卷轴10%
    Array(2043803, 600)//长杖魔力必成卷
);
var 弓手 = Array(
    Array(2044501, 40),//弓攻击卷轴60%
    Array(2044502, 40),//弓攻击卷轴10%
    Array(2044503, 800),//弓攻击必成卷
    Array(2044601, 40),//弩攻击卷轴60%
    Array(2044602, 40),//弩攻击卷轴10%
    Array(2044603, 800)//弩攻击必成卷
);
var 飞侠 = Array(
    Array(2043301, 40),//短剑攻击卷轴60%
    Array(2043302, 40),//短剑攻击卷轴10%
    Array(2043303, 800),//短剑攻击必成卷
    Array(2044701, 40),//拳套攻击卷轴60%
    Array(2044702, 40),//拳套攻击卷轴10%
    Array(2044703, 800)//拳套攻击必成卷
);
var 海盗 = Array(
    Array(2044801, 40),//拳甲攻击卷轴60%
    Array(2044802, 40),//拳甲攻击卷轴10%
    Array(2044901, 40),//短枪攻击卷轴60%
    Array(2044902, 40)//短枪攻击卷轴10%
);
var 通用 = Array(
    Array(2040612, 60),//裤裙敏捷卷轴10%
    Array(2040613, 40),//裤裙敏捷卷轴60%
    Array(2040614, 20),//裤裙敏捷卷轴100%
    Array(2040617, 10),//裤裙跳跃卷轴100%
    Array(2040618, 20),//裤裙跳跃卷轴60%
    Array(2040619, 30),//裤裙跳跃卷轴10%
    Array(2048000, 10),//宠物速度卷轴100%
    Array(2048001, 30),//宠物速度卷轴60%
    Array(2048002, 40),//宠物速度卷轴10%
    Array(2048003, 20),//宠物跳跃力卷轴100%
    Array(2048004, 40),//宠物跳跃力卷轴60%
    Array(2048005, 40),//宠物跳跃力卷轴10%
    Array(2049100, 400),//混沌卷轴60%
    Array(2040703, 20),//鞋子跳跃卷轴100%
    Array(2040704, 40),//鞋子跳跃卷轴60%
    Array(2040705, 60),//鞋子跳跃卷轴10%
    Array(2040706, 10),//鞋子速度卷轴100%
    Array(2040707, 20),//鞋子速度卷轴60%
    Array(2040708, 30)//鞋子速度卷轴10%
);
var 力量 = Array(
    Array(2048010, 60),//宠物力量卷轴60%
    Array(2041100, 60),//戒指力量卷轴100%
    Array(2041101, 80),//戒指力量卷轴60%
    Array(2041102, 100),//戒指力量卷轴10%
    Array(2041300, 60),//腰带力量卷轴100%
    Array(2041301, 80),//腰带力量卷轴60%
    Array(2041302, 100),//腰带力量卷轴10%
    Array(2040758, 800),//鞋子攻击卷轴100%
    Array(2040759, 1200),//鞋子攻击卷轴60%
    Array(2040760, 1600),//鞋子攻击卷轴10%
    Array(2040417, 10),//上衣力量卷轴100%
    Array(2040418, 20),//上衣力量卷轴60%
    Array(2040419, 30),//上衣力量卷轴10%
    Array(2040530, 20),//全身盔甲力量卷轴100%
    Array(2040532, 40),//全身盔甲力量卷轴60%
    Array(2040534, 10),//全身盔甲力量卷轴10%
    Array(2040803, 100),//手套攻击卷轴100%
    Array(2040804, 200),//手套攻击卷轴60%
    Array(2040805, 300),//手套攻击卷轴10%
    Array(2040807, 800),//手套攻击必成卷
    Array(2040914, 50),//盾牌攻击卷轴60%
    Array(2040915, 60),//盾牌攻击卷轴10%
    Array(2040929, 30),//盾牌力量卷轴100%
    Array(2040931, 10),//盾牌力量卷轴60%
    Array(2040933, 20),//盾牌力量卷轴10%
    Array(2041012, 10),//披风力量卷轴100%
    Array(2041013, 20),//披风力量卷轴60%
    Array(2041014, 30)//披风力量卷轴10%
);
var 敏捷 = Array(
    Array(2048012, 60),//宠物敏捷卷轴60%
    Array(2041106, 60),//戒指敏捷卷轴100%
    Array(2041107, 80),//戒指敏捷卷轴60%
    Array(2041108, 100),//戒指敏捷卷轴10%
    Array(2041306, 60),//腰带敏捷卷轴100%
    Array(2041307, 80),//腰带敏捷卷轴60%
    Array(2041308, 100),//腰带敏捷卷轴10%
    Array(2040758, 800),//鞋子攻击卷轴100%
    Array(2040759, 1200),//鞋子攻击卷轴60%
    Array(2040760, 1600),//鞋子攻击卷轴10%
    Array(2040027, 30),//头盔敏捷卷轴100%
    Array(2040028, 40),//头盔敏捷卷轴60%
    Array(2040029, 60),//头盔敏捷卷轴10%
    Array(2040316, 30),//耳环敏捷卷轴100%
    Array(2040317, 40),//耳环敏捷卷轴60%
    Array(2040318, 60),//耳环敏捷卷轴10%
    Array(2040500, 20),//全身铠甲敏捷卷轴100%
    Array(2040501, 30),//全身铠甲敏捷卷轴60%
    Array(2040502, 40),//全身铠甲敏捷卷轴10%
    Array(2040506, 200),//全身铠甲敏捷必成卷
    Array(2040803, 100),//手套攻击卷轴100%
    Array(2040804, 200),//手套攻击卷轴60%
    Array(2040805, 300),//手套攻击卷轴10%
    Array(2040807, 800),//手套攻击必成卷
    Array(2041018, 10),//披风敏捷卷轴100%
    Array(2041019, 20),//披风敏捷卷轴60%
    Array(2041020, 30)//披风敏捷卷轴10%
);
var 智力 = Array(
    Array(2048011, 60),//宠物智力卷轴60%
    Array(2041103, 60),//戒指智力卷轴100%
    Array(2041104, 80),//戒指智力卷轴60%
    Array(2041105, 100),//戒指智力卷轴10%
    Array(2041303, 60),//腰带智力卷轴100%
    Array(2041304, 80),//腰带智力卷轴60%
    Array(2041305, 100),//腰带智力卷轴10%
    Array(2040024, 30),//头盔智力卷轴100%
    Array(2040025, 40),//头盔智力卷轴60%
    Array(2040026, 60),//头盔智力卷轴10%
    Array(2040205, 40),//眼部装饰智力卷轴10%
    Array(2040206, 30),//眼部装饰智力卷轴60%
    Array(2040207, 20),//眼部装饰智力卷轴100%
    Array(2040300, 20),//耳环智力卷轴100%
    Array(2040301, 30),//耳环智力卷轴60%
    Array(2040302, 40),//耳环智力卷轴10%
    Array(2040512, 20),//全身铠甲智力卷轴100%
    Array(2040513, 30),//全身铠甲智力卷轴60%
    Array(2040514, 40),//全身铠甲智力卷轴10%
    Array(2040816, 120),//手套魔力卷轴10%
    Array(2040817, 80),//手套魔力卷轴60%
    Array(2040818, 40),//手套魔力卷轴100%
    Array(2040918, 50),//盾牌魔力卷轴100%
    Array(2040919, 100),//盾牌魔力卷轴60%
    Array(2040920, 200),//盾牌魔力卷轴10%
    Array(2041015, 10),//披风智力卷轴100%
    Array(2041016, 20),//披风智力卷轴60%
    Array(2041017, 50)//披风智力卷轴10%
);
var 运气 = Array(
    Array(2048013, 60),//宠物运气卷轴60%
    Array(2041109, 60),//戒指运气卷轴100%
    Array(2041110, 80),//戒指运气卷轴60%
    Array(2041111, 100),//戒指运气卷轴10%
    Array(2041309, 60),//腰带运气卷轴100%
    Array(2041310, 80),//腰带运气卷轴60%
    Array(2041311, 100),//腰带运气卷轴10%
    Array(2040758, 800),//鞋子攻击卷轴100%
    Array(2040759, 1200),//鞋子攻击卷轴60%
    Array(2040760, 1500),//鞋子攻击卷轴10%
    Array(2040319, 30),//耳环装饰运气卷轴100%
    Array(2040321, 40),//耳环装饰运气卷轴60%
    Array(2040323, 50),//耳环装饰运气卷轴10%
    Array(2040412, 20),//上衣运气卷轴10%
    Array(2040413, 30),//上衣运气卷轴60%
    Array(2040414, 40),//上衣运气卷轴100%
    Array(2040515, 20),//全身铠甲运气卷轴100%
    Array(2040516, 30),//全身铠甲运气卷轴60%
    Array(2040517, 40),//全身铠甲运气卷轴10%
    Array(2040803, 100),//手套攻击卷轴100%
    Array(2040804, 200),//手套攻击卷轴60%
    Array(2040805, 300),//手套攻击卷轴10%
    Array(2040807, 800),//手套攻击必成卷
    Array(2040914, 50),//盾牌攻击卷轴60%
    Array(2040915, 60),//盾牌攻击卷轴10%
    Array(2040923, 10),//盾牌运气卷轴100%
    Array(2040924, 20),//盾牌运气卷轴60%
    Array(2040925, 30),//盾牌运气卷轴10%
    Array(2041021, 20),//披风运气卷轴100%
    Array(2041022, 30),//披风运气卷轴60%
    Array(2041023, 40)//披风运气卷轴10%
);
var status;
var 星星 = "#fUI/UIWindow.img/Megaphone/0#";
function start() {
    status = -1;
    action(1, 0, 0);
}
var 卷轴列表 = Array();
function action(mode, type, selection) {
    if (mode == -1) {
        im.dispose();
    } else {
        if (mode == 0 && type > 0) {
            im.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;

        if (status == 0) {
            var job = im.getPlayer().getJob().getId();
            var type = 0;
            if (job == 0 || job == 800 || job == 900 || job == 910 || job == 1000 || job == 2000) {
                im.sendOk("无法为新手提供服务");
                im.dispose();
                return;
            }
            while (job >= 1000)
                job -= 1000;
            if ((job >= 100 && job < 133)) {//战士系
                for (var i = 0; i < 战士.length; i++) {
                    卷轴列表.push(战士[i]);
                }
                for (var i = 0; i < 通用.length; i++) {
                    卷轴列表.push(通用[i]);
                }
                for (var i = 0; i < 力量.length; i++) {
                    卷轴列表.push(力量[i]);
                }

            } else if ((job >= 200 && job < 233)) {//法师系
                for (var i = 0; i < 法师.length; i++) {
                    卷轴列表.push(法师[i]);
                }
                for (var i = 0; i < 通用.length; i++) {
                    卷轴列表.push(通用[i]);
                }
                for (var i = 0; i < 智力.length; i++) {
                    卷轴列表.push(智力[i]);
                }
            } else if ((job >= 300 && job < 323)) {//弓手
                for (var i = 0; i < 弓手.length; i++) {
                    卷轴列表.push(弓手[i]);
                }
                for (var i = 0; i < 通用.length; i++) {
                    卷轴列表.push(通用[i]);
                }
                for (var i = 0; i < 敏捷.length; i++) {
                    卷轴列表.push(敏捷[i]);
                }
            } else if ((job >= 400 && job < 423)) {//飞侠
                for (var i = 0; i < 飞侠.length; i++) {
                    卷轴列表.push(飞侠[i]);
                }
                for (var i = 0; i < 通用.length; i++) {
                    卷轴列表.push(通用[i]);
                }
                for (var i = 0; i < 运气.length; i++) {
                    卷轴列表.push(运气[i]);
                }
            } else if ((job >= 500 && job < 523)) {//海盗
                for (var i = 0; i < 海盗.length; i++) {
                    卷轴列表.push(海盗[i]);
                }
                for (var i = 0; i < 通用.length; i++) {
                    卷轴列表.push(通用[i]);
                }
                for (var i = 0; i < 力量.length; i++) {
                    卷轴列表.push(力量[i]);
                }
                for (var i = 0; i < 敏捷.length; i++) {
                    卷轴列表.push(敏捷[i]);
                }
            }
            var text = "#e你好,我可以为你合成需要的卷轴\r\n#n#b";
            var all = im.getPlayer().getItemQuantity(2430033, false);
            for (var i = 0; i < 卷轴列表.length; i++) {
                if (all < 卷轴列表[i][1])
                    text += "#L" + i + "#" + 星星 + "#b#z" + 卷轴列表[i][0] + "#(#e#r" + 卷轴列表[i][1] + "张#z2430033##b#n)#l\r\n";
                else
                    text += "#L" + i + "#" + 星星 + "#b#z" + 卷轴列表[i][0] + "#(#e#d" + 卷轴列表[i][1] + "张#z2430033##b#n)#l\r\n";
            }
            im.sendSimple(text);
        } else if (status == 1) {
            item = 卷轴列表[selection][0];
            fee = 卷轴列表[selection][1];
            im.sendYesNo("#e确定要使用" + fee + "张#z2430033#合成#r#z" + item + "##k?");
        } else {
            if (im.getPlayer().canHold(item)) {
                if (im.getPlayer().haveItem(2430033, fee)) {
                    im.gainItem(item, 1);
                    im.gainItem(2430033, -fee);
                    im.sendOk("制作完成");
                    im.getPlayer().全服道具喇叭(im.getPlayer().getName(), false, item);
                    status = -1;
                } else {
                    im.sendOk("对不起,你没有足够的#z2430033#");
                    im.dispose();
                }
            } else {
                im.sendOk("对不起,背包满了无法合成");
                im.dispose();
            }
        }
    }
}
var item;
var fee;